Revit 2018 API
OpenOptions Members
The OpenOptions type exposes the following members.
Constructors
Name | Description
OpenOptions
 Constructs a new instance of the options class using default values.
Methods
Name | Description
Dispose
Releases all resources used by the OpenOptions
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOpenWorksetsConfiguration
 Gets the object used to configure the worksets to open when the model is opened.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetOpenWorksetsConfiguration
 Sets the object used to configure the worksets to open when the model is opened.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AllowOpeningLocalByWrongUser
 Specifies whether a local file is allowed to be opened as read-only by a user other than its owner.
Audit
 Specifies whether to expand all elements in order to check for corruption.
DetachFromCentralOption
 An option that specifies whether or not a workset-enabled document is detached from its central document.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
OpenOptions Class
Autodesk.Revit.DB Namespace